config/betamocks/cache/mvi/profile/796068291.yml

---
:method: :post
:body: <env:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header/><env:Body><idm:PRPA_IN201306UV02
  xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  ITSVersion="XML_1.0" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd"><id
  extension="WSDOC1709080108508610227750298" root="2.16.840.1.113883.4.349"/><creationTime
  value="20170908010850"/><versionCode code="3.0"/><interactionId extension="PRPA_IN201306UV02"
  root="2.16.840.1.113883.1.6"/><processingCode code="T"/><processingModeCode code="T"/><acceptAckCode
  code="NE"/><receiver typeCode="RCV"><device determinerCode="INSTANCE" classCode="DEV"><id
  extension="200VGOV" root="2.16.840.1.113883.4.349"/></device></receiver><sender
  typeCode="SND"><device determinerCode="INSTANCE" classCode="DEV"><id extension="200M"
  root="2.16.840.1.113883.4.349"/></device></sender><acknowledgement><typeCode code="AA"/><targetMessage><id
  extension="200VGOV-2781df3f-5cb3-4e64-a188-609eae94c6e7" root="1.2.840.114350.1.13.0.1.7.1.1"/></targetMessage><acknowledgementDetail><code
  codeSystemName="MVI" code="132" displayName="IMT"/><text>Identity Match Threshold</text></acknowledgementDetail><acknowledgementDetail><code
  codeSystemName="MVI" code="120" displayName="PDT"/><text>Potential Duplicate Threshold</text></acknowledgementDetail></acknowledgement><controlActProcess
  classCode="CACT" moodCode="EVN"><code codeSystem="2.16.840.1.113883.1.6" code="PRPA_TE201306UV02"/><queryAck><queryId
  extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><queryResponseCode code="NF"/><resultCurrentQuantity
  value="0"/></queryAck><queryByParameter><queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/><statusCode
  code="new"/><modifyCode code="MVI.COMP1"/><initialQuantity value="1"/><parameterList><livingSubjectAdministrativeGender><value
  code="M"/><semanticsText>Gender</semanticsText></livingSubjectAdministrativeGender><livingSubjectBirthTime><value
  value="19671030"/><semanticsText>Date of Birth</semanticsText></livingSubjectBirthTime><livingSubjectId><value
  extension="796068291" root="2.16.840.1.113883.4.1"/><semanticsText>SSN</semanticsText></livingSubjectId><livingSubjectName><value
  use="L"><given>DERRICK</given><given>A</given><family>STEWART</family></value><semanticsText>Legal
  Name</semanticsText></livingSubjectName></parameterList></queryByParameter></controlActProcess></idm:PRPA_IN201306UV02></env:Body></env:Envelope>
:headers:
  connection: close
  date: Fri, 08 Sep 2017 06:08:50 GMT
  content-length: '2674'
  content-type: text/xml
  set-cookie: JSESSIONID=NKJ5ZyzS4vBpm2QS2qy227yTM51x8DtsQVK17hsmRQ4v8mHMGlt3!544686593;
    path=/; HttpOnly
  x-powered-by: Servlet/2.5 JSP/2.1
:status: 200
